[
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Spotify_logo_without_text.svg/2048px-Spotify_logo_without_text.svg.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 1,
    "description": "Stream music and podcasts online or offline anytime, anywhere.",
    "size": 85,
    "fileSize": "230MB",
    "reviews": "2.3M",
    "ratingAvg": 4.6,
    "downloads": "45M",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 4500000 },
      { "name": "5 star", "count": 16000000 }
    ],
    "appDetails": "Spotify is one of the world’s most popular music streaming services, giving users access to millions of songs, albums, and podcasts in just a few taps. Whether you’re relaxing at home, working out, or commuting, Spotify provides curated playlists for every moment and mood. You can follow your favorite artists, create custom playlists, and share tracks with friends directly through the app. Spotify’s powerful algorithm learns your taste over time and recommends personalized music mixes. The app supports both free (ad-supported) and premium plans, where premium users can download songs for offline listening, enjoy ad-free streaming, and get unlimited skips. Its cross-platform syncing ensures your playlists and preferences stay consistent across devices. Spotify also features collaborative playlists and group sessions that let multiple users control what’s playing. With Spotify Wrapped, users can review their annual listening trends and share them with friends. The platform’s integration with smart speakers, cars, and wearables makes it incredibly versatile. It even includes podcasts and audiobooks, making it a one-stop entertainment hub. Spotify is continuously evolving, offering new interactive features like Blend, Live sessions, and real-time lyrics. For music lovers worldwide, it’s more than just an app — it’s a personalized sound journey.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "id": 2,
    "description": "Send texts, calls, and photos instantly with friends and family.",
    "size": 70,
    "fileSize": "160MB",
    "reviews": "1.7M",
    "ratingAvg": 4.3,
    "downloads": "67M",
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 7000000 },
      { "name": "3 star", "count": 20000000 },
      { "name": "4 star", "count": 30000000 },
      { "name": "5 star", "count": 108000000 }
    ],
    "appDetails": "WhatsApp Messenger is the world’s leading free messaging application, used by billions of people to stay connected. It allows users to send text messages, voice notes, photos, videos, documents, and location instantly, even on low network connections. End-to-end encryption ensures that only you and the recipient can read or listen to what’s sent, maintaining privacy at all times. Users can make crystal-clear voice and video calls across the globe without international charges. WhatsApp Groups make it easy to organize family chats, work teams, or friend circles, and you can now join larger Communities for broader communication. WhatsApp Web and desktop apps keep your messages synced across all devices seamlessly. The app supports disappearing messages, status updates, and broadcast lists for wider sharing. Business accounts let companies interact with customers using quick replies and catalogs. Users can also react to messages, star important texts, and pin conversations for quick access. Multi-device support now allows you to use WhatsApp on multiple phones simultaneously. Regular updates bring new emojis, stickers, and privacy controls. Simple, fast, and secure — WhatsApp remains one of the most reliable tools for personal and professional communication in the digital world.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Facebook_Logo_2023.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Share posts, photos, and connect with friends and communities online.",
    "size": 120,
    "fileSize": "410MB",
    "reviews": "1.3M",
    "ratingAvg": 4.1,
    "downloads": "52M",
    "ratings": [
      { "name": "1 star", "count": 10000000 },
      { "name": "2 star", "count": 15000000 },
      { "name": "3 star", "count": 25000000 },
      { "name": "4 star", "count": 35000000 },
      { "name": "5 star", "count": 45000000 }
    ],
    "appDetails": "Facebook is the original social networking giant that connects billions of people worldwide. Users can post updates, share photos and videos, comment on others’ posts, and interact through likes and reactions. It’s not just a social app — it’s a digital ecosystem where communities, businesses, and creators thrive. Facebook Groups allow users to connect over shared interests, hobbies, or causes. Pages help businesses and public figures reach audiences and build their brand. The integrated Marketplace enables local buying and selling, while Events make organizing meetups easy. Facebook Live allows anyone to stream video in real-time and engage with viewers instantly. The platform supports Watch, a dedicated section for video content from creators and media outlets. Personalized feeds, powered by smart algorithms, ensure you see the content most relevant to you. Safety features, privacy settings, and content moderation continue to evolve for better user protection. With Messenger integration, private chats and video calls are just a tap away. Facebook also syncs with Instagram and WhatsApp for a unified social experience. The app continues to innovate with Reels, Avatars, and AI recommendations. For over a decade, Facebook has been the digital town square of the internet, shaping how people communicate, share, and discover.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Instagram_logo_2016.svg/1024px-Instagram_logo_2016.svg.png",
    "title": "Instagram",
    "companyName": "Instagram",
    "id": 4,
    "description": "Share photos, reels, and stories with friends and followers easily.",
    "size": 95,
    "fileSize": "320MB",
    "reviews": "1.3M",
    "ratingAvg": 4.4,
    "downloads": "88M",
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 8000000 },
      { "name": "3 star", "count": 20000000 },
      { "name": "4 star", "count": 32000000 },
      { "name": "5 star", "count": 64000000 }
    ],
    "appDetails": "Instagram is a global platform built around creativity, visuals, and storytelling. It lets users share photos, videos, Reels, and Stories to connect with followers and express themselves. The app’s clean interface makes content discovery simple and addictive. Reels allows for short, entertaining clips with trending music, filters, and effects — competing directly with TikTok. Instagram Stories, disappearing after 24 hours, keep your followers updated in real time. The Explore page uses AI to recommend posts you might love based on your interests. Users can follow hashtags, message friends directly, or shop from brands without leaving the app. Businesses and influencers use Instagram for marketing, sponsored posts, and brand partnerships. You can also collaborate with other creators using the Collab feature. With Instagram Live, creators can engage their audience directly, while pinned comments and Q&A make streams interactive. The app keeps privacy at its core with features like Close Friends and Hidden Words. Its design and aesthetic tools — from filters to advanced editing — help make every post stand out. Instagram also integrates with Facebook for cross-posting and Messenger for unified communication. Constantly evolving with new features, Instagram has become a hub for inspiration, trends, and digital identity for billions worldwide.",
    "action": "Install Now"
  },
  {
    "image": "https://img.freepik.com/premium-photo/tiktok-logo_1080029-103.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "id": 5,
    "description": "Watch, create, and share short videos for fun and entertainment.",
    "size": 110,
    "fileSize": "280MB",
    "reviews": "950k",
    "ratingAvg": 4.5,
    "downloads": "34M",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 57000000 }
    ],
    "appDetails": "TikTok is a short-form video platform that revolutionized how people create and consume content. It allows users to record, edit, and share 15-second to 10-minute videos across categories like dance, comedy, education, and lifestyle. TikTok’s powerful algorithm curates a personalized ‘For You Page’ (FYP) based on your watch behavior, ensuring endless entertainment. It’s a space where ordinary users become global sensations overnight. The app includes extensive editing tools, music integration, voice effects, and green screen features. Duets and Stitch let users collaborate creatively across videos. TikTok supports live streaming for creators to interact directly with audiences. The platform emphasizes trends, challenges, and hashtags that spread rapidly worldwide. Safety and digital wellbeing features include screen-time management and parental controls. TikTok for Business helps brands connect with audiences through authentic storytelling. It also has an in-app shopping feature, allowing influencers to promote products seamlessly. The diversity of content makes it suitable for all age groups and interests. With localized trends and global reach, TikTok connects communities in unique, creative ways. Its continuous innovation and global influence have made it a leading force in digital entertainment and culture today.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/en/c/c4/Snapchat_logo.svg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 6,
    "description": "Send snaps, chat, and share fun moments with your friends.",
    "size": 60,
    "fileSize": "150MB",
    "reviews": "310k",
    "ratingAvg": 4.2,
    "downloads": "23M",
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 13000000 }
    ],
    "appDetails": "Snapchat is a fun and fast multimedia messaging app that lets you communicate through photos, videos, and stories that disappear after being viewed. Known for its playful spirit, Snapchat encourages authentic and spontaneous communication. The app’s iconic lenses and AR filters let you transform your face and environment in creative ways. Bitmoji integration adds personalized avatars that represent you across chats and maps. Snap Map shows where your friends are and what’s happening around the world. The Discover tab brings curated news, entertainment, and influencer content tailored to your interests. You can send quick Snaps, maintain Streaks with friends, and share group stories. Snapchat also features Spotlight, a TikTok-like section where viral short videos get millions of views. Its privacy-first design gives you control over who can contact or view your content. The app constantly innovates with AR experiences, mini-games, and AI chat features like ‘My AI’. For creators, Snapchat offers monetization tools, analytics, and partnerships through the Creator Hub. Whether chatting with friends or exploring trending filters, Snapchat combines creativity with communication, making it one of the most engaging platforms for young audiences worldwide.",
    "action": "Install Now"
  },
  {
    "image": "https://png.pngtree.com/png-vector/20221018/ourmid/pngtree-youtube-social-media-round-icon-png-image_6315993.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 7,
    "description": "Watch and upload videos, follow creators, and explore trending content.",
    "size": 150,
    "fileSize": "500MB",
    "reviews": "1.45M",
    "ratingAvg": 4.7,
    "downloads": "76M",
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 7000000 },
      { "name": "3 star", "count": 12000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 96000000 }
    ],
    "appDetails": "YouTube is the largest video-sharing platform in the world, home to billions of videos across every imaginable topic. From tutorials, music videos, gaming, and entertainment to live news and educational lectures — it offers something for everyone. Users can subscribe to channels, like, comment, and share videos effortlessly. The app allows creators to upload high-quality content, monetize through ads, and connect with audiences via the Community tab and Shorts. YouTube’s recommendation engine uses AI to suggest personalized videos that match your interests. YouTube Premium offers ad-free viewing, background play, and offline downloads for convenience. The YouTube Music integration lets users stream songs and watch live performances within the same app. Live streaming enables creators and organizations to broadcast events to global audiences in real-time. With YouTube Kids, parents can ensure safe viewing for children. Shorts brings the short-form video trend directly into the platform, making content creation faster and more dynamic. Whether you’re learning a skill, watching reviews, or following your favorite vlogger, YouTube serves as both an entertainment hub and a powerful learning platform. Constantly evolving with new features, it continues to shape global media consumption and creativity.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/83/Telegram_2019_Logo.svg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 8,
    "description": "Fast, secure messaging with cloud backup and private chat options.",
    "size": 65,
    "fileSize": "200MB",
    "reviews": "1.5M",
    "ratingAvg": 4.5,
    "downloads": "19M",
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 8800000 }
    ],
    "appDetails": "Telegram is a fast, cloud-based instant messaging app built for speed, privacy, and reliability. It offers secure chats, voice calls, and file sharing with no size limits. All your messages, photos, and videos are stored in the cloud, so you can access them from any device seamlessly. Telegram supports large groups and channels where millions of members can interact or stay informed. Its end-to-end encrypted Secret Chats ensure privacy and self-destructing messages for sensitive communication. Users can send documents up to 2GB each, share media in original quality, and create polls or quizzes easily. Telegram Bots add automation for gaming, reminders, or even business workflows. Themes and customization options let users personalize the app’s look and feel. Telegram Premium adds extra features like faster downloads, larger uploads, and advanced management tools. The app’s focus on open-source technology and security makes it popular among developers and tech-savvy users. Telegram also supports voice chats, video calls, and live streams inside channels. With cross-platform support, it works flawlessly across phones, tablets, and desktops. Combining power, simplicity, and freedom, Telegram is not just a messenger — it’s a complete communication ecosystem designed for the modern era.",
    "action": "Install Now"
  }
]
