[
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Spotify_logo_without_text.svg/2048px-Spotify_logo_without_text.svg.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 1,
    "description": "Stream music and podcasts online or offline anytime, anywhere.",
    "size": 85,
    "fileSize": "230MB",
    "reviews": "2.3M",
    "ratingAvg": 4.6,
    "downloads": "45M",
    "ratings": [
      {
        "name": "1 star",
        "count": 500000
      },
      {
        "name": "2 star",
        "count": 700000
      },
      {
        "name": "3 star",
        "count": 1500000
      },
      {
        "name": "4 star",
        "count": 4500000
      },
      {
        "name": "5 star",
        "count": 16000000
      }
    ],
    "appDetails": "Spotify stands as a global titan in digital music streaming, offering an unparalleled library that grants users access to millions of songs, albums, and podcasts right at their fingertips. It's more than just a music player; it's a personalized sonic universe tailored to individual tastes. Users can explore a vast array of genres, from chart-topping hits to underground indie tracks, and listen to spoken-word content covering news, comedy, education, and more. A key feature is the platform's sophisticated recommendation algorithm, which learns listening habits to create highly personalized playlists like 'Discover Weekly' and 'Daily Mixes.' This makes finding new music effortless and enjoyable. The app supports both online and offline listening, allowing premium subscribers to download content for playback without an internet connection, perfect for commutes or travel. Spotify is also a major hub for podcasting, hosting exclusive shows and providing robust tools for creators. The user interface is designed for intuitive navigation, making it easy to build personal libraries, share music with friends, and follow favorite artists. With various subscription tiers, including a free, ad-supported option and several premium plans, Spotify caters to a diverse global audience looking for high-quality audio content anytime, anywhere. It has profoundly reshaped the music industry's landscape, championing artist discovery and on-demand access to media.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "id": 2,
    "description": "Send texts, calls, and photos instantly with friends and family.",
    "size": 70,
    "fileSize": "160MB",
    "reviews": "1.7M",
    "ratingAvg": 4.3,
    "downloads": "67M",
    "ratings": [
      {
        "name": "1 star",
        "count": 5000000
      },
      {
        "name": "2 star",
        "count": 7000000
      },
      {
        "name": "3 star",
        "count": 20000000
      },
      {
        "name": "4 star",
        "count": 30000000
      },
      {
        "name": "5 star",
        "count": 108000000
      }
    ],
    "appDetails": "WhatsApp Messenger is the definitive global leader in free, cross-platform instant messaging, revolutionizing how billions of people communicate daily. It offers a simple, reliable, and secure way to connect with friends and family worldwide using just a phone number. The core function allows users to send and receive text messages, voice messages, photos, videos, documents, and their location instantly. Crucially, WhatsApp features end-to-end encryption by default for all personal chats and calls, ensuring that only the sender and recipient can read or listen to the communication—not even WhatsApp itself. This commitment to privacy is a significant factor in its massive popularity. Beyond one-on-one chats, the app facilitates group chats for family, work, or social circles, and supports both voice and video calls that are clear and reliable over Wi-Fi or mobile data. Users can personalize their communication with a wide array of emoji, stickers, and GIFs, and share fleeting updates via the 'Status' feature. WhatsApp Business also extends the platform's utility, enabling seamless communication between businesses and their customers. Its minimal data usage and accessibility across different operating systems have cemented its status as an indispensable messaging tool.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Facebook_Logo_2023.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Share posts, photos, and connect with friends and communities online.",
    "size": 120,
    "fileSize": "410MB",
    "reviews": "1.3M",
    "ratingAvg": 4.1,
    "downloads": "52M",
    "ratings": [
      {
        "name": "1 star",
        "count": 10000000
      },
      {
        "name": "2 star",
        "count": 15000000
      },
      {
        "name": "3 star",
        "count": 25000000
      },
      {
        "name": "4 star",
        "count": 35000000
      },
      {
        "name": "5 star",
        "count": 45000000
      }
    ],
    "appDetails": "Facebook is the original social networking giant, a platform that was instrumental in defining the modern digital social experience and continues to connect billions of people worldwide. It serves as a comprehensive hub for sharing personal updates, photos, videos, and life events with a curated network of friends and family. The platform is designed to foster both personal connections and engagement with broader communities. Users can create detailed personal profiles, join groups based on shared interests, and RSVP to local and global events. The News Feed is the central feature, a dynamic stream where users discover content from their connections, followed pages, and relevant news sources. Facebook's influence extends into various domains, including news consumption, political discourse, and e-commerce through its Marketplace. Its robust set of tools includes built-in photo editing, live video streaming capabilities, and integrated messaging via Messenger. For businesses, Facebook provides powerful advertising and page management tools, making it an essential component of modern digital marketing. Despite the evolving social media landscape, Facebook remains a dominant force, constantly introducing new features to keep its vast user base engaged with a diverse range of content from around the globe, making it a critical part of many people's daily digital lives.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Instagram_logo_2016.svg/1024px-Instagram_logo_2016.svg.png",
    "title": "Instagram",
    "companyName": "Instagram",
    "id": 4,
    "description": "Share photos, reels, and stories with friends and followers easily.",
    "size": 95,
    "fileSize": "320MB",
    "reviews": "1.3M",
    "ratingAvg": 4.4,
    "downloads": "88M",
    "ratings": [
      {
        "name": "1 star",
        "count": 6000000
      },
      {
        "name": "2 star",
        "count": 8000000
      },
      {
        "name": "3 star",
        "count": 20000000
      },
      {
        "name": "4 star",
        "count": 32000000
      },
      {
        "name": "5 star",
        "count": 64000000
      }
    ],
    "appDetails": "Instagram is a globally influential social media platform built entirely around creativity, visuals, and storytelling, transforming how people share their lives through images and short-form video. Initially focused on high-quality photo sharing, it has expanded significantly to embrace multimedia content. The platform's success is rooted in its visually-centric interface, which allows users to easily capture, edit with various filters, and share aesthetic moments from their day. Key features include the traditional Feed for permanent posts, Stories for fleeting 24-hour updates, and Reels, a dedicated space for short, entertaining vertical videos that leverage trending sounds and effects. This diversification ensures that creators and users have multiple formats for expression. Instagram has become a primary vehicle for influencer marketing and a showcase for brands, artists, and photographers worldwide. The 'Explore' tab uses a sophisticated algorithm to surface personalized content, making discovery a central part of the user experience. Users can interact through likes, comments, direct messages (DMs), and engaging with live streams. It fosters both personal connection with friends and aspirational connection with public figures and brands. Instagram’s continuous evolution, particularly its emphasis on video content, solidifies its position as an essential and vibrant platform for visual culture.",
    "action": "Install Now"
  },
  {
    "image": "https://img.freepik.com/premium-photo/tiktok-logo_1080029-103.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "id": 5,
    "description": "Watch, create, and share short videos for fun and entertainment.",
    "size": 110,
    "fileSize": "280MB",
    "reviews": "950k",
    "ratingAvg": 4.5,
    "downloads": "34M",
    "ratings": [
      {
        "name": "1 star",
        "count": 4000000
      },
      {
        "name": "2 star",
        "count": 6000000
      },
      {
        "name": "3 star",
        "count": 10000000
      },
      {
        "name": "4 star",
        "count": 18000000
      },
      {
        "name": "5 star",
        "count": 57000000
      }
    ],
    "appDetails": "TikTok is a global phenomenon, a short-form video platform that fundamentally revolutionized how people create and consume digital content. It's characterized by its extremely addictive 'For You' page (FYP), a stream of personalized, endless videos powered by an exceptionally effective recommendation algorithm. This algorithm prioritizes content over creator popularity, making it possible for anyone to go viral instantly. The platform is a vibrant ecosystem for creativity, music, comedy, dance, and rapid-fire trends. Videos are typically 15 seconds to three minutes long, encouraging users to be concise, engaging, and innovative. Its extensive library of popular music, sound effects, and easy-to-use editing tools, including filters and augmented reality effects, lowers the barrier to entry for content creation. TikTok has a massive cultural impact, driving global music charts, setting fashion trends, and becoming a dominant source of entertainment, especially for younger demographics. It has introduced unique features like 'Duets' and 'Stitch,' allowing users to directly interact with and build upon others' content, fostering a sense of community and collaborative creation. For brands and creators, it offers unparalleled reach and engagement, making it one of the most dynamic and fastest-growing social media applications worldwide, constantly pushing the boundaries of digital entertainment.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/en/c/c4/Snapchat_logo.svg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 6,
    "description": "Send snaps, chat, and share fun moments with your friends.",
    "size": 60,
    "fileSize": "150MB",
    "reviews": "310k",
    "ratingAvg": 4.2,
    "downloads": "23M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 3000000
      },
      {
        "name": "3 star",
        "count": 5000000
      },
      {
        "name": "4 star",
        "count": 8000000
      },
      {
        "name": "5 star",
        "count": 13000000
      }
    ],
    "appDetails": "Snapchat is a fun and fast multimedia messaging app that redefined digital communication by centering it around ephemeral content, or 'snaps,' which are photos or videos that disappear shortly after they are viewed. This concept of temporary sharing encourages more spontaneous, authentic, and less curated interaction among friends. The app is a primary communication tool for its core user base, focused on direct, moment-to-moment sharing. The main interface opens directly to the camera, emphasizing instant content creation. Users can enhance their snaps with a vast library of augmented reality (AR) Lenses, which change daily and overlay faces or the environment with fun, interactive effects. Key communication features include the ability to send snaps, engage in instant chat, and share multi-snap 'Stories' that compile a user's recent moments for friends to view. Beyond personal communication, Snapchat offers a 'Discover' page featuring professionally produced short-form content from various media publishers, as well as the 'Spotlight' feature, which promotes engaging, user-created short videos. The app also emphasizes location-based sharing with Snap Maps and features personalized bitmoji avatars. Snapchat’s core identity is built on its playful approach, innovative AR technology, and commitment to the spontaneity of quick, visual communication among friends.",
    "action": "Install Now"
  },
  {
    "image": "https://png.pngtree.com/png-vector/20221018/ourmid/pngtree-youtube-social-media-round-icon-png-image_6315993.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 7,
    "description": "Watch and upload videos, follow creators, and explore trending content.",
    "size": 150,
    "fileSize": "500MB",
    "reviews": "1.45M",
    "ratingAvg": 4.7,
    "downloads": "76M",
    "ratings": [
      {
        "name": "1 star",
        "count": 5000000
      },
      {
        "name": "2 star",
        "count": 7000000
      },
      {
        "name": "3 star",
        "count": 12000000
      },
      {
        "name": "4 star",
        "count": 25000000
      },
      {
        "name": "5 star",
        "count": 96000000
      }
    ],
    "appDetails": "YouTube is the largest and most influential video-sharing platform in the world, serving as a global repository for user-generated content, professional media, and live streaming. Owned by Google, it is a dominant force in online entertainment, education, news, and music, hosting billions of videos that cater to virtually every interest imaginable. From short clips to full-length documentaries, the platform is the go-to source for visual content. Users can easily watch and upload videos, subscribe to their favorite channels, follow creators, and participate in comment section discussions. Its vast library includes music videos, instructional tutorials, vlogs, news segments, movie trailers, and original content produced by a diverse range of creators known as 'YouTubers.' The platform has a highly sophisticated recommendation engine that drives content discovery based on viewing history. YouTube supports various playback options, including high definition and 4K streaming, and has continually expanded its features with offerings like YouTube Shorts for short-form content and YouTube Premium for ad-free viewing and offline downloads. For creators, it provides a viable career path through its Partner Program, allowing for monetization through advertising and subscriptions. YouTube's sheer scale and variety make it an indispensable part of the modern internet and digital media consumption.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/83/Telegram_2019_Logo.svg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 8,
    "description": "Fast, secure messaging with cloud backup and private chat options.",
    "size": 65,
    "fileSize": "200MB",
    "reviews": "1.5M",
    "ratingAvg": 4.5,
    "downloads": "19M",
    "ratings": [
      {
        "name": "1 star",
        "count": 700000
      },
      {
        "name": "2 star",
        "count": 900000
      },
      {
        "name": "3 star",
        "count": 1500000
      },
      {
        "name": "4 star",
        "count": 3500000
      },
      {
        "name": "5 star",
        "count": 8800000
      }
    ],
    "appDetails": "Telegram is a powerful, cloud-based instant messaging app built with a core focus on speed, privacy, and reliability, offering an alternative to traditional messaging platforms. Unlike many competitors, Telegram's chats and media are securely stored in the cloud, allowing users to access them from multiple devices simultaneously, a key advantage for cross-platform utility. It facilitates standard one-on-one chats, large group chats, and uniquely, massive channels that can broadcast messages to unlimited subscribers, making it a popular tool for public announcements and community building. Users can send text, voice messages, stickers, and a wide variety of files, with generous limits on file size that surpass most other messengers. Privacy is a major selling point, with features like 'Secret Chats' that use end-to-end encryption and include self-destruct timers for messages and media. Telegram is also known for its open API and support for bots, which enhance functionality for everything from task automation to gaming. Its dedication to being a free, secure, and feature-rich communication platform has made it a preferred choice for individuals, journalists, and organizations that prioritize fast delivery and robust privacy measures.",
    "action": "Install Now"
  },
  {
    "image": "https://images.icon-icons.com/2699/PNG/512/netflix_logo_icon_170919.png",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "id": 9,
    "description": "Watch movies, TV shows, and documentaries anytime, anywhere.",
    "size": 180,
    "fileSize": "450MB",
    "reviews": "3.1M",
    "ratingAvg": 4.8,
    "downloads": "90M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 3000000
      },
      {
        "name": "3 star",
        "count": 8000000
      },
      {
        "name": "4 star",
        "count": 15000000
      },
      {
        "name": "5 star",
        "count": 60000000
      }
    ],
    "appDetails": "Netflix is the world's leading subscription-based, on-demand streaming service, offering a vast and constantly evolving library of movies, TV shows, and documentaries to watch anytime, anywhere. It single-handedly pioneered the streaming revolution, transforming the home entertainment landscape by offering an alternative to traditional cable television and video rental stores. The platform's success is driven by its massive catalog of licensed content and, increasingly, its investment in 'Netflix Originals'—exclusive, high-quality series and films that are often critically acclaimed and globally popular. The content spans numerous genres, languages, and countries, catering to a diverse global audience. Key user features include a sophisticated personalization engine that uses viewing data to provide highly accurate content recommendations, and the ability to create multiple user profiles within a single account. Users can also download content for offline viewing, making it perfect for travel. The platform's commitment to releasing entire seasons of shows at once (the 'binge model') and its continued global expansion solidifies its position as the dominant force in the world of premium online video entertainment.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Gmail_Icon.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 10,
    "description": "Send and receive emails securely with Google's official mail app.",
    "size": 90,
    "fileSize": "190MB",
    "reviews": "2.8M",
    "ratingAvg": 4.6,
    "downloads": "100M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 4000000
      },
      {
        "name": "3 star",
        "count": 6000000
      },
      {
        "name": "4 star",
        "count": 16000000
      },
      {
        "name": "5 star",
        "count": 70000000
      }
    ],
    "appDetails": "Gmail is Google's official, highly reliable, and immensely popular email platform, providing users with a secure and feature-rich application for all their electronic communication needs. As one of the world's most widely used email services, it is renowned for its seamless integration with the broader Google ecosystem, including Drive, Calendar, and Meet. The app's interface is designed for maximum efficiency, featuring a powerful search function and intelligent categorization of incoming mail into tabs like Primary, Social, and Promotions, which helps users manage their inbox clutter effectively. A critical feature is its robust spam filtering, which uses Google's machine learning capabilities to block unwanted messages with high accuracy, ensuring a secure communication experience. Users benefit from generous cloud storage, allowing them to send and receive large file attachments easily. Collaboration is a key focus, with features like Smart Reply, Smart Compose, and the ability to work with Google Docs directly within the email environment. Whether for personal use or professional business, Gmail offers a fast, accessible, and secure platform for managing digital correspondence on the go, making it the industry standard for modern email.",
    "action": "Install Now"
  },
  {
    "image": "https://img.freepik.com/free-vector/twitter-new-2023-x-logo-white-background-vector_1017-45422.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 11,
    "description": "Stay updated with the latest news and trends across the world.",
    "size": 100,
    "fileSize": "250MB",
    "reviews": "1.9M",
    "ratingAvg": 4.2,
    "downloads": "60M",
    "ratings": [
      {
        "name": "1 star",
        "count": 3000000
      },
      {
        "name": "2 star",
        "count": 4000000
      },
      {
        "name": "3 star",
        "count": 10000000
      },
      {
        "name": "4 star",
        "count": 18000000
      },
      {
        "name": "5 star",
        "count": 35000000
      }
    ],
    "appDetails": "X, formerly known as Twitter, is a real-time, microblogging and social networking platform that serves as a vital global town square for staying updated with the latest news, trends, and public discourse as they happen. The platform is defined by its concise format, where users post short updates, known as 'posts' or 'tweets,' which can include text, images, videos, and links. It is particularly powerful during major global events, breaking news, or cultural moments, where information, reactions, and opinions propagate almost instantaneously. Users follow individuals, organizations, and news outlets to curate a personalized, real-time feed of information. The use of hashtags allows for tracking and participating in specific global conversations and trending topics. Key features include the ability to 'repost' (retweet) content, reply to threads, and send direct messages. X's influence extends deeply into journalism, politics, and celebrity culture, often driving the national and international conversation. It offers a unique window into the collective global sentiment, allowing users to not only consume but also actively contribute to the immediate, public pulse of the world, making it an essential tool for rapid information exchange.",
    "action": "Install Now"
  },
  {
    "image": "https://img.freepik.com/premium-vector/round-zoom-logo-isolated-white-background_469489-904.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "Zoom Cloud Meetings",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 12,
    "description": "Host or join video meetings and webinars with ease.",
    "size": 130,
    "fileSize": "300MB",
    "reviews": "1.1M",
    "ratingAvg": 4.4,
    "downloads": "48M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 3000000
      },
      {
        "name": "3 star",
        "count": 7000000
      },
      {
        "name": "4 star",
        "count": 15000000
      },
      {
        "name": "5 star",
        "count": 26000000
      }
    ],
    "appDetails": "Zoom Cloud Meetings is a world-leading video conferencing application that has become essential for both professional and personal digital communication, specializing in facilitating high-quality video meetings, webinars, and collaborative sessions with exceptional ease. It rose to global prominence by offering a reliable and user-friendly solution for remote work and learning. The platform is known for its clear HD video and audio quality, even under varying internet conditions. Core features allow hosts to manage large groups, including screen sharing for presentations, chat functions, and virtual backgrounds to maintain privacy. It supports one-on-one meetings and large group conferences with various security options, like password protection and waiting rooms, to ensure a controlled environment. Zoom integrates smoothly with popular scheduling tools and offers session recording for later review. It’s highly scalable, catering to small team check-ins, large corporate webinars, and educational virtual classrooms. By focusing on simplicity, reliability, and robust feature sets, Zoom has cemented its status as the go-to tool for real-time, face-to-face interaction when physical presence is not possible, enabling global collaboration and connectivity.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Google_Drive_icon_%282020%29.svg/1200px-Google_Drive_icon_%282020%29.svg.png",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 13,
    "description": "Store, share, and access your files securely from anywhere.",
    "size": 95,
    "fileSize": "210MB",
    "reviews": "2.2M",
    "ratingAvg": 4.7,
    "downloads": "80M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1500000
      },
      {
        "name": "2 star",
        "count": 2500000
      },
      {
        "name": "3 star",
        "count": 4000000
      },
      {
        "name": "4 star",
        "count": 9000000
      },
      {
        "name": "5 star",
        "count": 62000000
      }
    ],
    "appDetails": "Google Drive is a foundational cloud-based storage service that empowers users to store, share, and access their files securely from any device, anywhere in the world. As a core component of Google's suite of productivity tools, it provides a centralized and safe location for all personal and professional digital documents, photos, and videos. A key strength is its seamless and deep integration with Google Docs, Sheets, and Slides, allowing users to create, edit, and collaborate on office documents in real-time directly within the cloud environment. This capability revolutionizes teamwork, as multiple users can work on the same document simultaneously, seeing changes as they happen, eliminating version control issues. The app's robust search functionality makes finding specific files effortless, and its sharing permissions are highly customizable, ensuring that files are only accessible to intended collaborators. Users can also view numerous file types directly within the app without needing external software. With automatic backups and a strong emphasis on security, Google Drive is an essential, reliable, and versatile tool for modern digital organization, productivity, and cloud-based file management across all major platforms.",
    "action": "Install Now"
  },
  {
    "image": "https://yt3.googleusercontent.com/ytc/AIdro_ncrXPzrg5_WVvTEx_w3El2dorNHS7r9AMO8Mph8l7Z_dU=s900-c-k-c0x00ffffff-no-rj",
    "title": "Tinder",
    "companyName": "Match Group",
    "id": 14,
    "description": "Meet new people and connect with matches nearby.",
    "size": 75,
    "fileSize": "160MB",
    "reviews": "800k",
    "ratingAvg": 4.0,
    "downloads": "32M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 4000000
      },
      {
        "name": "3 star",
        "count": 8000000
      },
      {
        "name": "4 star",
        "count": 9000000
      },
      {
        "name": "5 star",
        "count": 10000000
      }
    ],
    "appDetails": "Tinder is a globally recognized and highly influential dating application that introduced the concept of the simple 'swipe' interface to connect people and facilitate new social encounters. It is a location-based social search mobile app designed to make the process of meeting new people and forming connections—from friendships to romantic relationships—fast, simple, and exciting. The core mechanism is incredibly straightforward: users swipe right on a profile they are interested in and swipe left on those they are not. A 'match' occurs only when two users have both swiped right on each other, at which point they can begin messaging. This mutual opt-in system ensures a baseline level of mutual interest before communication starts. Tinder encourages users to build appealing profiles with photos, short bios, and links to their interests, and its geographic functionality prioritizes displaying potential matches nearby. The platform has been instrumental in normalizing and demystifying online dating, transforming it into a mainstream and widely accepted way for individuals to expand their social circles and meet potential partners. Its blend of simplicity, proximity, and mutual consent has made it a global leader in the dating app space.",
    "action": "Install Now"
  },
  {
    "image": "https://cdn3.iconfinder.com/data/icons/free-social-icons/67/linkedin_circle_color-512.png",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "id": 15,
    "description": "Connect with professionals and grow your career network.",
    "size": 100,
    "fileSize": "220MB",
    "reviews": "1.6M",
    "ratingAvg": 4.3,
    "downloads": "40M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 3000000
      },
      {
        "name": "3 star",
        "count": 6000000
      },
      {
        "name": "4 star",
        "count": 12000000
      },
      {
        "name": "5 star",
        "count": 22000000
      }
    ],
    "appDetails": "LinkedIn is the world's premier professional networking platform, serving as the essential digital hub for career development, job searching, industry insights, and business connections. Unlike traditional social media, LinkedIn is specifically designed to help individuals build their professional brand, connect with colleagues, and advance their careers. It functions as a global resume and a professional database rolled into one. Users create detailed profiles that highlight their work history, skills, education, and professional endorsements. This information is used to connect them with potential employers, recruiters, and industry peers. A central feature is the professional feed, which contains career-related news, articles from thought leaders, and job postings relevant to the user's field. The platform is also a powerhouse for job seekers, offering extensive search and application tools, and for companies, it’s a critical resource for recruitment and business development. LinkedIn Learning provides educational courses to upskill users. Its commitment to fostering a professional community makes it an indispensable tool for students entering the workforce, established executives, and anyone looking to grow their network and career opportunities.",
    "action": "Install Now"
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Paypal_2014_logo.png",
    "title": "PayPal",
    "companyName": "PayPal Holdings, Inc.",
    "id": 16,
    "description": "Send and receive money securely worldwide.",
    "size": 85,
    "fileSize": "190MB",
    "reviews": "1.2M",
    "ratingAvg": 4.5,
    "downloads": "55M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1000000
      },
      {
        "name": "2 star",
        "count": 2000000
      },
      {
        "name": "3 star",
        "count": 4000000
      },
      {
        "name": "4 star",
        "count": 9000000
      },
      {
        "name": "5 star",
        "count": 27000000
      }
    ],
    "appDetails": "PayPal is a pioneering and trusted digital payment platform that allows users to send, receive, and manage money securely worldwide, facilitating e-commerce and peer-to-peer transactions. It serves as a secure middleman between banks or credit cards and merchants, allowing users to make purchases online without exposing their financial details to every seller. A primary strength of PayPal is its enhanced security and buyer protection policies, which offer users peace of mind when shopping online. The application simplifies the process of sending money to friends and family globally, often with just an email address or phone number, making international transfers much simpler. The ability to link various bank accounts and credit cards to a single, secure PayPal wallet makes it a versatile payment solution. The app also provides tools for small businesses and freelancers to easily issue invoices and accept payments. With its decades of experience and global acceptance by millions of online retailers, PayPal has cemented its status as a reliable and secure standard for both consumer and commercial digital financial transactions in the modern e-commerce landscape.",
    "action": "Install Now"
  }
]